swak4Foam/Examples/other/capillaryRise/system/funkySetFieldsDict
FoamFile
{
    version         2.0;
    format          ascii;

    root            "/.automount/werner/Werner/bgschaid/bgschaid-foamStuff/DepositionTests";
    case            "neutralTest";
    instance        "system";
    local           "";

    class           dictionary;
    object          funkySetFieldsDict;
}

expressions
(
	setLiquid
	{
		field alpha1;
		expression "(pos().y<8e-3) ? 1 : 0";
		keepPatches true;
	}
);
